Repository: lunaship/dsh-cetus
Catalog: apps/ios/App/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# pairing.invalidCode
source: This pairing code is invalid or expired. Refresh it on your computer.
zh_hans: 配对码无效或已过期，请在电脑上刷新。

# pairing.invalidQR
source: This is not a valid cetus pairing QR code.
zh_hans: 这不是有效的 cetus 配对二维码。

# pairing.invalidResponse
source: The computer returned an invalid pairing response.
zh_hans: 电脑返回了无效的配对响应。

# pairing.lan
source: Local network
zh_hans: 局域网

# pairing.lanBody
source: cetus needs local network access to connect to dsh on your computer.
zh_hans: cetus 需要本地网络权限，才能连接电脑上的 dsh。

# pairing.lanTitle
source: Connect to your computer
zh_hans: 连接你的电脑

# pairing.nameTaken
source: A phone with this name already exists. Use a different name.
zh_hans: 已存在同名设备，请更换名称。

# pairing.networkFailure
source: None of the addresses in the QR code could be reached.
zh_hans: 二维码里的所有地址都无法连接。

# pairing.networkTitle
source: Unable to connect to your computer
zh_hans: 连不上你的电脑

# pairing.noAddress
source: This QR code has no direct connection address.
zh_hans: 二维码没有可用的直连地址。

# pairing.noPhotoQR
source: No pairing QR code could be recognized in this image.
zh_hans: 无法从这张图片识别配对二维码。

# pairing.photo
source: Recognize from Photos
zh_hans: 从相册识别

# pairing.photoReading
source: Recognizing QR code…
zh_hans: 正在识别二维码…

# pairing.rejected
source: The computer rejected the request, or it timed out.
zh_hans: 电脑拒绝了配对请求，或请求已超时。

# pairing.rename
source: Choose another name
zh_hans: 换个名字

# pairing.renameBody
source: Enter a different name for this phone.
zh_hans: 为这台手机输入一个不同的名称。

# pairing.renameTitle
source: Phone name
zh_hans: 本机名称

# pairing.replace
source: Replace it
zh_hans: 替换它

# pairing.retry
source: Pair
zh_hans: 配对

# pairing.route
source: Connection
zh_hans: 连接方式

# pairing.sameNameBody
source: It may be from a previous installation. Replace it, or choose another name. Approval will replace the old phone when computer confirmation is enabled.
zh_hans: 可能来自上次安装。可以替换它，或换个名字；电脑开启确认时，批准后才会替换旧设备。

# pairing.sameNameTitle
source: A phone with this name already exists
zh_hans: 已有同名设备

# pairing.scan
source: Scan to pair
zh_hans: 扫码配对

# pairing.scanBody
source: Find it in the Mobile Connection panel in dsh.
zh_hans: 二维码在 dsh 的「手机连接」面板里。

# pairing.scanPhoto
source: Choose from Photos
zh_hans: 从相册选择

# pairing.scanPreview
source: Camera preview
zh_hans: 相机预览

# pairing.scanTitle
source: Scan the pairing QR code on your computer
zh_hans: 扫描电脑上的配对二维码

# pairing.settings
source: Open Settings
zh_hans: 去设置打开

# pairing.stepOne
source: Open dsh on your computer
zh_hans: 在电脑上打开 dsh

# pairing.stepOneBody
source: Open the Mobile Connection panel.
zh_hans: 进入「手机连接」面板。

# pairing.stepThree
source: Approve on your computer
zh_hans: 在电脑上点「批准」

# pairing.stepThreeBody
source: When confirmation is enabled, approve in the panel.
zh_hans: 若电脑开启了配对确认，请在面板中批准。

# pairing.stepTwo
source: Scan the QR code in the panel
zh_hans: 扫描面板上的二维码

# pairing.stepTwoBody
source: Use the same network, or install Tailscale on both devices.
zh_hans: 同一网络，或两边都装了 Tailscale。

# pairing.storageFailure
source: Pairing credentials could not be saved on this phone.
zh_hans: 无法在本机保存配对记录。

# pairing.submitting
source: Sending pairing request…
zh_hans: 正在发送配对请求…

# pairing.suggestions
source: Try these steps
zh_hans: 可以试试

# pairing.tipApproval
source: Check the pairing request in the computer panel.
zh_hans: 检查电脑面板里的配对请求。

# pairing.tipCameraSettings
source: Enable camera access for cetus in Settings.
zh_hans: 在设置中为 cetus 打开相机权限。

# pairing.tipCertificate
source: Confirm that the QR code comes from the computer you want to pair with.
zh_hans: 确认二维码来自你要连接的电脑。

# pairing.tipClearPhoto
source: Choose a clear image showing the entire QR code.
zh_hans: 选择完整、清晰的二维码图片。

# pairing.tipClock
source: Check that your phone and computer clocks are correct.
zh_hans: 检查手机和电脑的时间是否正确。

# pairing.tipCorrectQR
source: Select the pairing QR code from the dsh panel.
zh_hans: 选择 dsh 面板中的配对二维码。

# pairing.tipHost
source: Keep dsh running and check the Mobile Connection panel on your computer.
zh_hans: 保持电脑上的 dsh 运行，并检查「手机连接」面板。

# pairing.tipPhoto
source: Use Recognize from Photos on the welcome screen.
zh_hans: 在欢迎页使用「从相册识别」。

# pairing.tipRefresh
source: Refresh the QR code in the computer panel.
zh_hans: 刷新电脑面板上的二维码。

# pairing.tipRestart
source: Close and reopen cetus, then try again.
zh_hans: 关闭并重新打开 cetus 后再试。

# pairing.tipScan
source: Return and scan the current QR code again.
zh_hans: 返回后重新扫描当前二维码。

# pairing.tipStorage
source: Check that this phone has free storage space.
zh_hans: 检查本机是否有可用存储空间。

# pairing.tipTailscale
source: For Tailscale, confirm that both devices are online in the same network.
zh_hans: 使用 Tailscale 时，确认两端在线且属于同一网络。

# pairing.tipWait
source: Wait for the pairing cooldown before retrying.
zh_hans: 等待配对冷却结束后再试。

# pairing.tipWifi
source: Connect your phone and computer to the same Wi-Fi.
zh_hans: 确认手机和电脑连着同一个 Wi-Fi。

# pairing.tooManyAttempts
source: Too many pairing attempts. Wait a moment and try again.
zh_hans: 配对尝试过于频繁，请稍后重试。

# pairing.torch
source: Flashlight
zh_hans: 手电筒

# pairing.waitBody
source: A pairing request was sent to %@.
zh_hans: 已向 %@ 发送配对请求。

# pairing.waitHint
source: Approve this phone in the Mobile Connection panel on your computer.
zh_hans: 请在电脑的「手机连接」面板中批准这台手机。

# pairing.waitTitle
source: Waiting for computer approval
zh_hans: 等待电脑批准

# pairing.welcomeBody
source: Approve, answer, and follow progress away from your computer.
zh_hans: 审批、回答、看进度，不用守在电脑前。

# pairing.welcomeTitle
source: Put DSH in your pocket
zh_hans: 把电脑上的 DSH 放进口袋

# review.askChanges
source: Ask about these changes
zh_hans: 就这些改动提问

# review.askFile
source: Ask about this file
zh_hans: 就这个文件提问

# review.askHunk
source: Ask about this hunk
zh_hans: 就这段提问

# review.binaryFile
source: Binary file
zh_hans: 二进制文件

# review.changesRetry
source: Retry
zh_hans: 重试

# review.changesTitle
source: Changes
zh_hans: 改动

# review.changesUnavailable
source: Changes unavailable
zh_hans: 改动摘要不可用（主机重启或版本过旧）

# review.copied
source: Copied
zh_hans: 已复制

# review.copyPath
source: Copy path
zh_hans: 复制路径

# review.diffAddedLine
source: Added, line %d: %@
zh_hans: 新增，第 %d 行：%@

# review.diffDeletedLine
source: Deleted, line %d: %@
zh_hans: 删除，第 %d 行：%@

# review.diffNoteCoarse
source: Compared as whole file (line diff timed out)
zh_hans: 按整文件对比（逐行对比超时）

# review.diffNoteCreated
source: New file
zh_hans: 新文件

# review.diffNoteDeleted
source: File deleted
zh_hans: 文件已删除

# review.diffNoteTruncated
source: Diff truncated
zh_hans: 对比已截断

# review.diffNoteUnchanged
source: No changes
zh_hans: 没有改动

# review.diffOpen
source: Diff
zh_hans: 查看对比

# review.diffTitle
source: Diff
zh_hans: 对比

# review.discarded
source: Check failed. The download was discarded.
zh_hans: 校验不一致，已丢弃

# review.filesEmptyDir
source: Empty directory
zh_hans: 空目录

# review.filesError
source: Couldn't load directory
zh_hans: 目录加载失败

# review.filesLoading
source: Loading…
zh_hans: 加载中…

# review.filesOutside
source: Outside workspace
zh_hans: 指向工作区外

# review.filesOutsideHint
source: Symbolic link points outside the workspace
zh_hans: 符号链接指向工作区外，无法打开

# review.filesRetry
source: Retry
zh_hans: 重试

# review.filesTitle
source: Files
zh_hans: 文件

# review.filesTruncated
source: Showing first entries
zh_hans: 只显示前部分条目

# review.nextHunk
source: Next
zh_hans: 下一个

# review.nextTurn
source: Next
zh_hans: 下一轮

# review.previewDetected
source: Detected — not yet approved
zh_hans: 已检测到——尚未批准

# review.previewEmpty
source: No preview
zh_hans: 还没有预览

# review.previewEmptyDetail
source: Approved ports from the computer show up here.
zh_hans: 电脑批准端口之后，会出现在这里。

# review.previewLocal
source: Opens only on this phone
zh_hans: 只在这台手机上打开

# review.previewNeedsApproval
source: Approve this port on your computer first
zh_hans: 请先在电脑上批准这个端口

# review.previewTitle
source: Preview
zh_hans: 预览

# review.previousHunk
source: Previous
zh_hans: 上一个

# review.previousTurn
source: Previous
zh_hans: 上一轮

# review.quote
source: Quote in chat
zh_hans: 引用到对话

# review.root
source: Workspace
zh_hans: 工作区

# review.shareFile
source: Share
zh_hans: 分享

# review.turn
source: Turn %d
zh_hans: 第 %d 轮

# scene.banner
source: Banner
zh_hans: 横幅

# scene.chip
source: Chip
zh_hans: 胶囊

# scene.code
source: Code
zh_hans: 代码

# scene.composer
source: Composer
zh_hans: 输入

# scene.decision
source: Decision
zh_hans: 决策

# scene.empty
source: Empty
zh_hans: 空态

# scene.inbox
source: Inbox
zh_hans: 收件箱

# scene.process
source: Process
zh_hans: 过程

# scene.state.disabled
source: Disabled
zh_hans: 禁用

# scene.state.long
source: Long text
zh_hans: 长文本

# scene.state.standard
source: Standard
zh_hans: 标准

# scene.status
source: Status
zh_hans: 状态

# settings.about
source: About
zh_hans: 关于

# settings.agent
source: Agent
zh_hans: 智能体

# settings.apiKey
source: API key
zh_hans: API 密钥

# settings.appearance
source: Appearance
zh_hans: 外观

# settings.balance
source: Balance
zh_hans: 余额

# settings.balanceAlert
source: Balance reminder
zh_hans: 余额提醒

# settings.balanceAlertAmount
source: Amount
zh_hans: 金额

# settings.balanceFailed
source: Balance lookup failed
zh_hans: 余额查询失败

# settings.balanceSignedOut
source: Signed out on this computer
zh_hans: 这台电脑尚未登录

# settings.balanceValue
source: Unavailable
zh_hans: 暂无

# settings.buildCommit
source: Build
zh_hans: 构建

# settings.buildConfiguration
source: Configuration
zh_hans: 构建配置

# settings.buildContractVersion
source: Contract
zh_hans: 合同版本

# settings.buildDate
source: Built
zh_hans: 构建日期

# settings.busyQueue
source: Queue
zh_hans: 排队发送

# settings.busySend
source: Send while running
zh_hans: 运行中再次发送

# settings.computer
source: This computer
zh_hans: 这台电脑

# settings.copyResult
source: Copy result
zh_hans: 复制结果

# settings.crash
source: Last crash
zh_hans: 上次崩溃

# settings.crashBody
source: MetricKit keeps the last diagnostic on this phone. Nothing is uploaded.
zh_hans: MetricKit 把上次诊断留在这台手机上。不会上传。

# settings.customProviderDesktop
source: Custom protocol and base URL stay on the computer.
zh_hans: 自定义协议和地址只在电脑上设置。

# settings.defaults
source: Conversation defaults
zh_hans: 对话默认

# settings.diagnostics
source: Connection diagnostics
zh_hans: 连接诊断

# settings.diagnosticsEmpty
source: No diagnostics yet. Connect to your computer and try again.
zh_hans: 暂无诊断结果。请连接电脑后重试。

# settings.diagnosticsTestedAt
source: Tested %@
zh_hans: 测试时间 %@

# settings.diagnosticsUnavailable
source: Diagnostics are unavailable on this computer.
zh_hans: 这台电脑暂时不能诊断。

# settings.discoverModels
source: Fetch models
zh_hans: 获取模型

# settings.errorCertificate
source: The computer certificate does not match.
zh_hans: 电脑证书不匹配。

# settings.errorConflict
source: This setting changed on the computer. Reload it.
zh_hans: 这项设置已在电脑上变化，请重新加载。

# settings.errorEmptyKey
source: Enter an API key before saving.
zh_hans: 保存前请输入 API 密钥。

# settings.errorEmptyModels
source: Keep at least one model.
zh_hans: 至少保留一个模型。

# settings.errorInvalidAmount
source: Enter an amount of zero or more.
zh_hans: 请输入大于或等于零的金额。

# settings.errorInvalidKey
source: This API key is not accepted.
zh_hans: 这个 API 密钥不被接受。

# settings.errorMissingHost
source: This computer is not paired.
zh_hans: 这台电脑尚未配对。

# settings.errorModelsInherited
source: These models are inherited and cannot be edited here.
zh_hans: 这些模型是继承的，不能在这里修改。

# settings.errorNotAddable
source: This provider cannot be added from the phone.
zh_hans: 这个提供方不能从手机添加。

# settings.errorOffline
source: This computer is offline.
zh_hans: 这台电脑离线。

# settings.errorReadOnly
source: This setting is read only.
zh_hans: 这项设置是只读的。

# settings.errorRejected
source: The computer rejected this change.
zh_hans: 电脑拒绝了这项修改。

# settings.errorUnauthorized
source: Sign in again on this computer.
zh_hans: 请在这台电脑上重新登录。

# settings.exportCrash
source: Export
zh_hans: 导出

# settings.general
source: General
zh_hans: 通用

# settings.history
source: Session history
zh_hans: 会话记录

# settings.historyEmpty
source: No archived sessions on this phone.
zh_hans: 这台手机上没有已归档的会话。

# settings.lan
source: Local network
zh_hans: 局域网

# settings.language
source: Language
zh_hans: 语言

# settings.languageValue
source: Follows the system
zh_hans: 跟随系统

# settings.legal
source: Legal
zh_hans: 法律文档

# settings.legalBody
source: Privacy and terms stay on this phone until you export them.
zh_hans: 隐私和政策留在这台手机上，除非你自己导出。

# settings.licenses
source: Open source licenses
zh_hans: 开源许可

# settings.liveActivity
source: Live Activity
zh_hans: 实时活动

# settings.model
source: Model
zh_hans: 模型

# settings.modelValue
source: Not chosen
zh_hans: 未选择

# settings.models
source: Models and balance
zh_hans: 模型与余额

# settings.modelsEmpty
source: Models and balance are read from this computer.
zh_hans: 模型和余额从这台电脑读取。

# settings.notPaired
source: Not connected
zh_hans: 未连接

# settings.notifications
source: Notifications
zh_hans: 通知

# settings.notifyApproval
source: When approval is needed
zh_hans: 需要审批时

# settings.notifyDone
source: When a task finishes
zh_hans: 任务完成时

# settings.notifyFailed
source: When a task fails
zh_hans: 任务失败时

# settings.notifyMaster
source: Notifications
zh_hans: 通知

# settings.notifyOff
source: Off
zh_hans: 关闭

# settings.notifyQuestion
source: When a question arrives
zh_hans: 需要回答时

# settings.notifyShortApproval
source: Approvals
zh_hans: 审批

# settings.notifyShortDone
source: Done
zh_hans: 完成

# settings.notifyShortFailed
source: Failures
zh_hans: 失败

# settings.notifyShortQuestion
source: Questions
zh_hans: 提问

# settings.offline
source: Offline
zh_hans: 离线

# settings.online
source: Online
zh_hans: 在线

# settings.other
source: Other
zh_hans: 其他

# settings.permission
source: Permission
zh_hans: 权限

# settings.permissionValue
source: Workspace write
zh_hans: 工作区写入

# settings.preset
source: Agent preset
zh_hans: 智能体预设

# settings.presetValue
source: Default
zh_hans: 默认

# settings.providers
source: Providers
zh_hans: 供应商

# settings.providersValue
source: None yet
zh_hans: 还没有

# settings.pushAuthAuthorized
source: Allowed
zh_hans: 已允许

# settings.pushAuthDenied
source: Denied
zh_hans: 已拒绝

# settings.pushAuthNotDetermined
source: Not asked yet
zh_hans: 尚未询问

# settings.pushFailed
source: Notifications could not be registered.
zh_hans: 通知没有注册成功。

# settings.pushGateway
source: Computer
zh_hans: 电脑

# settings.pushGatewayReady
source: Can send
zh_hans: 可发送

# settings.pushGatewayUnavailable
source: Not supported
zh_hans: 不支持

# settings.pushNote
source: Delivery through the official gateway arrives in a later update.
zh_hans: 通过官方网关推送会在后面的更新里接上。

# settings.pushPrivacy
source: Notifications pass through the gateway, but their content stays end-to-end encrypted. They can only open the app.
zh_hans: 通知经过网关转发，内容端到端加密；只能打开 App，不能直接批准。

# settings.pushSystemAuthorization
source: System permission
zh_hans: 系统权限

# settings.pushSystemDeniedHint
source: Notifications are turned off for cetus in system settings. The switch below cannot override that.
zh_hans: 系统设置里已关闭 cetus 的通知，下面的开关覆盖不了它。

# settings.pushUnavailable
source: This build cannot register for notifications.
zh_hans: 当前构建不能注册通知。

# settings.reasoningEffort
source: Reasoning
zh_hans: 推理等级

# settings.relay
source: Relay
zh_hans: 中继

# settings.renameComputer
source: Rename
zh_hans: 修改名称

# settings.renameFailed
source: Couldn’t rename this computer.
zh_hans: 没有改成这台电脑的名字。

# settings.replaceComputer
source: Replace computer
zh_hans: 更换电脑

# settings.saveModels
source: Save models
zh_hans: 保存模型

# settings.scenes
source: Component scenes
zh_hans: 组件场景

# settings.scenes.footer
source: Bundled fixtures only. These scenes do not use the network.
zh_hans: 这些场景只用随包数据，不联网。

# settings.themeDark
source: Dark
zh_hans: 深色

# settings.themeLight
source: Light
zh_hans: 浅色

# settings.themeSystem
source: System
zh_hans: 跟随系统

# settings.title
source: Settings
zh_hans: 设置

# settings.typeSizeNote
source: Text size follows the system setting.
zh_hans: 字号跟随系统设置。

# settings.unpair
source: Unpair
zh_hans: 解除配对

# settings.unpairFailed
source: Couldn’t unpair. The saved credential was kept.
zh_hans: 没有解除配对，本机凭证仍保留。

# settings.version
source: Version
zh_hans: 版本

# share.cancel
source: Cancel
zh_hans: 取消

# share.imageNote
source: Shared image
zh_hans: 分享的图片

# share.newTask
source: New task
zh_hans: 新任务

# share.newTaskDetail
source: Start in the current workspace
zh_hans: 在当前工作区新建

# share.sendTo
source: Send to
zh_hans: 发到

# share.title
source: Send to cetus
zh_hans: 发送到 cetus

# welcome.settings
source: Settings
zh_hans: 设置

# welcome.tryDemo
source: Try the demo
zh_hans: 先看看演示
